In [1]:
import numpy as np

In [2]:
import pandas as pd

In [14]:
labels = ['a','b','c']
name = ['linda', 'michael', 'jude']
my_data =[10,20,30]
arr = np.array(my_data)
d ={'a': 10, 'b': 20, 'c': 30}

In [15]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [16]:
pd.Series(data = my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [20]:
pd.Series(my_data, labels) 
# i can also have my series in this format without having assigning them to data or index provide i specify them in the correct order.

a    10
b    20
c    30
dtype: int64

In [22]:
pd.Series(arr)
#I can also pass a numpy array

0    10
1    20
2    30
dtype: int32

In [24]:
pd.Series(d)
#i can also pass in a dictionary.

a    10
b    20
c    30
dtype: int64

In [27]:
pd.Series(data=name)
#panda series can also hold an object datatype.

0      linda
1    michael
2       jude
dtype: object

In [28]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [30]:
pd.Series(data=[sum,print,len])
#We can also pass in built-in functions

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [31]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','Nigeria','Japan'])

In [32]:
ser1

USA        1
Germany    2
Nigeria    3
Japan      4
dtype: int64

In [33]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])

In [34]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [39]:
ser1['USA']

1

In [40]:
ser3 = pd.Series(data=labels)

In [41]:
ser3

0    a
1    b
2    c
dtype: object

In [43]:
ser3[0]

'a'

In [46]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
Nigeria    NaN
USA        2.0
dtype: float64

# Pandas DataFrames

In [47]:
import numpy as np
import pandas as pd

In [48]:
from numpy.random import randn

In [49]:
np.random.seed(101)

In [60]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
# This is just more like a pandas series but just sharing an index.

In [61]:
df

          W         X         Y         Z
A -0.971393 -1.522333  1.133703  0.528187
B  0.393461 -0.630507 -1.398290 -0.219311
C -0.045676  0.012421  0.093628  1.240813
D -1.097693 -1.908009 -0.380104 -1.666059
E -2.736995  1.522562  0.178009 -0.626805

In [62]:
df['W']

A   -0.971393
B    0.393461
C   -0.045676
D   -1.097693
E   -2.736995
Name: W, dtype: float64

In [63]:
type(df['W'])

pandas.core.series.Series

In [64]:
type(df)

pandas.core.frame.DataFrame

In [67]:
df.W
# We can also grap a column/ by this way by advicable to use the above. Using a dot looks like we are asking for a method.

A   -0.971393
B    0.393461
C   -0.045676
D   -1.097693
E   -2.736995
Name: W, dtype: float64

In [87]:
df[['W','Z']]
# To generate a series for more than one column, we passing a list of the column name.

          W         Z
A -0.971393  0.528187
B  0.393461 -0.219311
C -0.045676  1.240813
D -1.097693 -1.666059
E -2.736995 -0.626805

# Creation of new column

In [73]:
df['new'] = df['W'] + df['Y']

In [74]:
df

          W         X         Y         Z       new
A -0.971393 -1.522333  1.133703  0.528187  0.162310
B  0.393461 -0.630507 -1.398290 -0.219311 -1.004829
C -0.045676  0.012421  0.093628  1.240813  0.047952
D -1.097693 -1.908009 -0.380104 -1.666059 -1.477797
E -2.736995  1.522562  0.178009 -0.626805 -2.558986

# Dropping of Columns or Rows. Row(Axis = 0[default]), Column(Axis = 1)

In [82]:
df.drop('new', axis = 1, inplace = True)
# Without the 'inplace', the column will not be permanently removed.

In [83]:
df

          W         X         Y         Z
A -0.971393 -1.522333  1.133703  0.528187
B  0.393461 -0.630507 -1.398290 -0.219311
C -0.045676  0.012421  0.093628  1.240813
D -1.097693 -1.908009 -0.380104 -1.666059
E -2.736995  1.522562  0.178009 -0.626805

In [84]:
df.drop('E',axis = 0,)

          W         X         Y         Z
A -0.971393 -1.522333  1.133703  0.528187
B  0.393461 -0.630507 -1.398290 -0.219311
C -0.045676  0.012421  0.093628  1.240813
D -1.097693 -1.908009 -0.380104 -1.666059

In [85]:
df

          W         X         Y         Z
A -0.971393 -1.522333  1.133703  0.528187
B  0.393461 -0.630507 -1.398290 -0.219311
C -0.045676  0.012421  0.093628  1.240813
D -1.097693 -1.908009 -0.380104 -1.666059
E -2.736995  1.522562  0.178009 -0.626805

In [86]:
df.shape

(5, 4)

In [90]:
# Selecting rows
# We can select the rows by indexing using 'iloc' or the name of the row, using 'loc'.

In [88]:
df.loc['A']

W   -0.971393
X   -1.522333
Y    1.133703
Z    0.528187
Name: A, dtype: float64

In [89]:
df.iloc[2]

W   -0.045676
X    0.012421
Y    0.093628
Z    1.240813
Name: C, dtype: float64

In [91]:
df.loc['B','Y']

-1.3982896782716048

In [93]:
df.loc[['A','E'],['W','Y','X']]

          W         Y         X
A -0.971393  1.133703 -1.522333
E -2.736995  0.178009  1.522562

# DataFrames Part 2

In [3]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [4]:
np.random.seed(101)

In [7]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [8]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [10]:
booldf = df > 0

In [11]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [13]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

# Conditional Statement of selection

In [18]:
# We use the dataframe of dataframe to ignore/filter out the negative rows.

In [15]:
df[df['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [20]:
df[df['Z'] < 0] # we use this to just return our desire result.

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [26]:
resultdf = df[df['W'] > 0]

In [27]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [28]:
df[df['W'] > 0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [29]:
df[df['W'] > 0][['X','Z']]

          X         Z
A  0.628133  0.503826
B -0.319318  0.605965
D -0.758872  0.955057
E  1.978757  0.683509

# Concept of two or more conditions.

In [34]:
# We use the (& and |) for (AND and OR) for condition concatenation.

In [35]:
df[(df['W'] > 0) & (df['X'] > 1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [53]:
df.reset_index() 
# Resetting the index of a table to numerical and to make it permanent we use inplace=True.

  index         W         X         Y         Z States
0     A  2.706850  0.628133  0.907969  0.503826     CA
1     B  0.651118 -0.319318 -0.848077  0.605965     NY
2     C -2.018168  0.740122  0.528813 -0.589001     WY
3     D  0.188695 -0.758872 -0.933237  0.955057     OR
4     E  0.190794  1.978757  2.605967  0.683509     CO

In [54]:
newind = 'CA NY WY OR CO'.split()

In [55]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [56]:
df['States'] = newind

In [57]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [58]:
df.set_index('States') 
# setting a column to be an index and making it permanent, we use inplace.

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [59]:
# DataFrames Part 3(Hierachy)

In [60]:
import numpy as np
import pandas as pd

In [61]:
# Index Levels

In [67]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [69]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [77]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [83]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [84]:
df

             A         B
G1 1 -1.467514 -0.494095
   2 -0.162535  0.485809
   3  0.392489  0.221491
G2 1 -0.855196  1.541990
   2  0.666319 -0.538235
   3 -0.568581  1.407338

In [85]:
df.loc['G1']

          A         B
1 -1.467514 -0.494095
2 -0.162535  0.485809
3  0.392489  0.221491

In [89]:
df.loc['G1'].loc[1]

A   -1.467514
B   -0.494095
Name: 1, dtype: float64

In [90]:
df.loc['G1'].loc[1]['B']

-0.49409535833912277

In [91]:
df.index.names

FrozenList([None, None])

In [96]:
df.index.names = ['Groups','Num']
# naming the index of the hierachy table.

In [97]:
df

                   A         B
Groups Num
G1     1   -1.467514 -0.494095
       2   -0.162535  0.485809
       3    0.392489  0.221491
G2     1   -0.855196  1.541990
       2    0.666319 -0.538235
       3   -0.568581  1.407338

In [98]:
df

                   A         B
Groups Num
G1     1   -1.467514 -0.494095
       2   -0.162535  0.485809
       3    0.392489  0.221491
G2     1   -0.855196  1.541990
       2    0.666319 -0.538235
       3   -0.568581  1.407338

In [104]:
df.xs(1, level = 'Num')
# This cross-section helps to dig deep in a dataframe

               A         B
Groups
G1     -1.467514 -0.494095
G2     -0.855196  1.541990

In [105]:
df.xs(1, level = 'Num')['A']

Groups
G1   -1.467514
G2   -0.855196
Name: A, dtype: float64

# Pandas - Missing Data

In [106]:
import numpy as np
import pandas as pd

In [108]:
d = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}

In [109]:
df = pd.DataFrame(d)

In [110]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [113]:
df.dropna(axis = 1)
# For columns

   C
0  1
1  2
2  3

In [114]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [115]:
df.dropna(thresh = 2)
# Thresh accept intergers and it help to set number of atleast'na' to drop.

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [116]:
df.fillna(value='Fill Value')
# This is use in filling the 'na' data spaces.

            A           B  C
0           1           5  1
1           2  Fill Value  2
2  Fill Value  Fill Value  3

In [117]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Pandas-Groupby

In [118]:
import numpy as np
import pandas as pd

In [119]:
# Create dataframe

In [120]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [121]:
df=pd.DataFrame(data)

In [122]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [123]:
df.groupby('Company')

In [124]:
byComp = df.groupby('Company')

In [128]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [129]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [130]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [135]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [136]:
df.groupby('Company').sum().loc['FB']
# All in one line

Sales    593
Name: FB, dtype: int64

In [137]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [138]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [140]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [141]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [143]:
df['Sales'].sum()

1377

# Merging, Joining, and Concatenating.

In [144]:
import numpy as np
import pandas as pd

In [145]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [146]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [147]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [148]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [149]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [150]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

# Concatenation
Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use pd.concat and pass in a list of DataFrames to concatenate together.

In [152]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [153]:
pd.concat([df1,df2,df3], axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [154]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})

In [155]:
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [157]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [158]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

# Merging
The merge function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. For example:

In [159]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [169]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [170]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [172]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [173]:
pd.merge(left,right,on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [176]:
 pd.merge(left, right, how='outer',on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [178]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [179]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [175]:
 pd.merge(left, right, how='right',on=['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [166]:
 pd.merge(left, right, how='left',on=['key1','key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [168]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

# Joining
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [180]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [181]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [182]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [183]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [184]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Pandas - Operations

In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})

In [4]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [5]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

# Use of UNIQUE and NUNIQUE

In [196]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [200]:
len(df['col2'].unique())
# len(df['col2'].unique()) is the same as df['col2'].nunique().
# the number of unique values

3

In [201]:
df['col2'].nunique()

3

In [203]:
df['col2'].value_counts()
# Counting the number of times a value occurs.

444    2
555    1
666    1
Name: col2, dtype: int64

In [206]:
df[df['col1'] > 2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [207]:
df[(df['col1'] > 2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [210]:
def times2(x):
    return x*2

# Introducing definition in python to dataframe.

In [209]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [212]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [213]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

# Removing column

In [218]:
df.drop('col1',axis = 1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [219]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [220]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [221]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

# Sorting and Ordering of DataFrames.

In [222]:
df.sort_values ('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [223]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [224]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [227]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [228]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [230]:
df.pivot_table(values='D', index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Pandas - Data Input and Output

In [3]:
import pandas as pd

In [4]:
# To check the location of your notebook.

In [5]:
pwd

'C:\\Users\\mike\\Downloads'

# To read csv files

In [6]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [7]:
df = pd.read_csv('example')

In [8]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [9]:
df.to_csv('My_output')

In [10]:
pd.read_csv('My_output')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [11]:
df.to_csv('My_output', index = False)

In [44]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

# EXCEL

In [29]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [30]:
df.to_excel('Excel_Sample2.xlsx',sheet_name='NewSheet')

In [43]:
pd.read_excel('Excel_Sample2.xlsx',index=False)

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

# HTML

In [32]:
data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [42]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019","December 19, 2019"
1,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019","December 19, 2019"
2,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019","December 19, 2019"
3,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","December 19, 2019"
4,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"

# SQL

In [45]:
from sqlalchemy import create_engine

In [46]:
engine = create_engine('sqlite:///:memory:')

In [48]:
df.to_sql('my_table',engine)

In [49]:
sqldf = pd.read_sql('my_table',con=engine)

In [50]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15